[
  {
    "user_query": "Hey, before I forget — could you tell me how many orders were placed last month? I was supposed to check this yesterday.",
    "reference_query": "number of orders placed last month"
  },
  {
    "user_query": "I know it's late but can you find all customers from New York who made a purchase over $500?",
    "reference_query": "customers from New York with purchases over $500"
  },
  {
    "user_query": "While waiting for my coffee I realized — do we have any pending shipments in the orders table?",
    "reference_query": "pending shipments in orders table"
  },
  {
    "user_query": "I was chatting with John and he said there were duplicate emails in the customer database — is that true?",
    "reference_query": "duplicate emails in customer table"
  },
  {
    "user_query": "Just wondering if you can pull up the list of products that are out of stock. I need it for a report.",
    "reference_query": "products that are out of stock"
  },
  {
    "user_query": "I had a weird dream about invoices — anyway, can you get me all invoices issued in June 2023?",
    "reference_query": "invoices issued in June 2023"
  },
  {
    "user_query": "By the way, happy Monday! Can you find employees who joined after 2022?",
    "reference_query": "employees who joined after 2022"
  },
  {
    "user_query": "Oh shoot, I meant to ask yesterday — what’s the total revenue from orders this quarter?",
    "reference_query": "total revenue from orders this quarter"
  },
  {
    "user_query": "My manager is on my case again 🙄 — can you pull customers with no purchases in the last year?",
    "reference_query": "customers with no purchases in the last year"
  },
  {
    "user_query": "Not sure if this makes sense, but can you show all product names and their stock count?",
    "reference_query": "product names and stock count"
  },
  {
    "user_query": "While updating the sales deck, I thought — how many orders are in 'processing' status?",
    "reference_query": "orders with status processing"
  },
  {
    "user_query": "Sorry if this is dumb, but what's the average delivery time for completed orders?",
    "reference_query": "average delivery time for completed orders"
  },
  {
    "user_query": "I hope you can help — find top 5 customers by total order value. Thanks!",
    "reference_query": "top 5 customers by total order value"
  },
  {
    "user_query": "I was cleaning up some data and got curious — which suppliers are from China?",
    "reference_query": "suppliers from China"
  },
  {
    "user_query": "Random question during lunch — how many unique products have been sold?",
    "reference_query": "number of unique products sold"
  },
  {
    "user_query": "I know this is last minute, but get all orders shipped via FedEx last month?",
    "reference_query": "orders shipped via FedEx last month"
  },
  {
    "user_query": "Before I hop off this call — show me customers with more than 3 returns.",
    "reference_query": "customers with more than 3 returns"
  },
  {
    "user_query": "Can you check if any products have a negative stock quantity? Weird bug maybe?",
    "reference_query": "products with negative stock quantity"
  },
  {
    "user_query": "LOL I almost forgot — are there any employees without an assigned department?",
    "reference_query": "employees without an assigned department"
  },
  {
    "user_query": "During my walk I remembered this — which orders were cancelled in December?",
    "reference_query": "orders cancelled in December"
  }
]
